tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18876_tdd.h
#define CM1PSEL_PCH                   2765
#define C1PCH                         2766
#define C1PCH0                        2767
#define CM1PSEL_PCH0                  2768
#define C1PCH1                        2769
#define CM1PSEL_PCH1                  2770
#define C1PCH2                        2771
#define CM1PSEL_PCH2                  2772
#define CM2CON0                       2773
#define CM2CON0_SYNC                  2774
#define C2SYNC                        2775
#define C2HYS                         2776
#define CM2CON0_HYS                   2777
#define C2SP                          2778
#define C2POL                         2779
#define CM2CON0_POL                   2780
#define CM2CON0_C2OUT                 2781
#define CM2CON0_OUT                   2782
#define CM2CON0_ON                    2783
#define C2ON                          2784
#define CM2CON1                       2785
#define C2INTN                        2786
#define CM2CON1_INTN                  2787
#define CM2CON1_INTP                  2788
#define C2INTP                        2789
#define CM2NSEL                       2790
#define C2NCH0                        2791
#define CM2NSEL_NCH0                  2792
#define C2NCH                         2793
#define CM2NSEL_NCH                   2794
#define C2NCH1                        2795
#define CM2NSEL_NCH1                  2796
#define C2NCH2                        2797
#define CM2NSEL_NCH2                  2798
#define CM2PSEL                       2799
#define CM2PSEL_PCH                   2800
#define C2PCH                         2801
#define C2PCH0                        2802
#define CM2PSEL_PCH0                  2803
#define C2PCH1                        2804
#define CM2PSEL_PCH1                  2805
#define CM2PSEL_PCH2                  2806
#define C2PCH2                        2807
#define CLCDATA                       2808
#define MLC1OUT                       2809
#define MLC2OUT                       2810
#define MLC3OUT                       2811
#define MLC4OUT                       2812
#define CLC1CON                       2813
#define CLC1CON_MODE                  2814
#define LC1MODE0                      2815
#define LC1MODE                       2816
#define CLC1CON_MODE0                 2817
#define LC1MODE1                      2818
#define CLC1CON_MODE1                 2819
#define LC1MODE2                      2820
#define CLC1CON_MODE2                 2821
#define LC1INTN                       2822
#define CLC1CON_INTN                  2823
#define LC1INTP                       2824
#define CLC1CON_INTP                  2825
#define LC1OUT                        2826
#define CLC1CON_OUT                   2827
#define LC1EN                         2828
#define CLC1CON_EN                    2829
#define CLC1POL                       2830
#define LC1G1POL                      2831
#define CLC1POL_G1POL                 2832
#define CLC1POL_G2POL                 2833
#define LC1G2POL                      2834
#define LC1G3POL                      2835
#define CLC1POL_G3POL                 2836
#define LC1G4POL                      2837
#define CLC1POL_G4POL                 2838
#define CLC1POL_POL                   2839
#define LC1POL                        2840
#define CLC1SEL0                      2841
#define LC1D1S                        2842
#define CLC1SEL0_D1S0                 2843
#define LC1D1S0                       2844
#define CLC1SEL0_D1S                  2845
#define CLC1SEL0_D1S1                 2846
#define LC1D1S1                       2847
#define CLC1SEL0_D1S2                 2848
#define LC1D1S2                       2849
#define CLC1SEL0_D1S3                 2850
#define LC1D1S3                       2851
#define LC1D1S4                       2852
#define CLC1SEL0_D1S4                 2853
#define CLC1SEL0_D1S5                 2854
#define LC1D1S5                       2855
#define LC1D1S6                       2856
#define CLC1SEL0_D1S6                 2857
#define LC1D1S7                       2858
#define CLC1SEL0_D1S7                 2859
#define CLC1SEL1                      2860
#define CLC1SEL1_D2S                  2861
#define CLC1SEL1_D2S0                 2862
#define LC1D2S0                       2863
#define LC1D2S                        2864
#define CLC1SEL1_D2S1                 2865
#define LC1D2S1                       2866
#define CLC1SEL1_D2S2                 2867
#define LC1D2S2                       2868
#define CLC1SEL1_D2S3                 2869
#define LC1D2S3                       2870
#define LC1D2S4                       2871
#define CLC1SEL1_D2S4                 2872
#define D2S5                          2873
#define LC1D2S5                       2874
#define LC1D2S6                       2875
#define CLC1SEL1_D2S6                 2876
#define CLC1SEL1_D2S7                 2877
#define LC1D2S7                       2878
#define CLC1SEL2                      2879
#define CLC1SEL2_D3S                  2880
#define LC1D3S0                       2881
#define LC1D3S                        2882
#define CLC1SEL2_D3S0                 2883
#define LC1D3S1                       2884
#define CLC1SEL2_D3S1                 2885
#define LC1D3S2                       2886
#define CLC1SEL2_D3S2                 2887
#define LC1D3S3                       2888
#define CLC1SEL2_D3S3                 2889
#define LC1D3S4                       2890
#define CLC1SEL2_D3S4                 2891
#define LC1D3S5                       2892
#define CLC1SEL2_D3S5                 2893
#define LC1D3S6                       2894
#define CLC1SEL2_D3S6                 2895
#define LC1D3S7                       2896
#define CLC1SEL2_D3S7                 2897
#define CLC1SEL3                      2898
#define LC1D4S                        2899
#define CLC1SEL3_D4S                  2900
#define LC1D4S0                       2901
#define CLC1SEL3_D4S0                 2902
#define LC1D4S1                       2903
#define CLC1SEL3_D4S1                 2904
#define LC1D4S2                       2905
#define CLC1SEL3_D4S2                 2906
#define LC1D4S3                       2907
#define CLC1SEL3_D4S3                 2908
#define LC1D4S4                       2909
#define CLC1SEL3_D4S4                 2910
#define LC1D4S5                       2911
#define CLC1SEL3_D4S5                 2912
#define LC1D4S6                       2913
#define CLC1SEL3_D4S6                 2914
#define LC1D4S7                       2915
#define CLC1SEL3_D4S7                 2916
#define CLC1GLS0                      2917
#define CLC1GLS0_D1N                  2918
#define LC1G1D1N                      2919
#define CLC1GLS0_D1T                  2920
#define LC1G1D1T                      2921
#define LC1G1D2N                      2922
#define CLC1GLS0_D2N                  2923
#define LC1G1D2T                      2924
#define CLC1GLS0_D2T                  2925
#define CLC1GLS0_D3N                  2926
#define LC1G1D3N                      2927
#define CLC1GLS0_D3T                  2928
#define LC1G1D3T                      2929
#define CLC1GLS0_D4N                  2930
#define LC1G1D4N                      2931
#define CLC1GLS0_D4T                  2932
#define LC1G1D4T                      2933
#define CLC1GLS1                      2934
#define CLC1GLS1_D1N                  2935
#define LC1G2D1N                      2936
#define LC1G2D1T                      2937
#define CLC1GLS1_D1T                  2938
#define CLC1GLS1_D2N                  2939
#define LC1G2D2N                      2940
#define LC1G2D2T                      2941
#define CLC1GLS1_D2T                  2942
#define CLC1GLS1_D3N                  2943
#define LC1G2D3N                      2944
#define LC1G2D3T                      2945
#define CLC1GLS1_D3T                  2946
#define CLC1GLS1_D4N                  2947
#define LC1G2D4N                      2948
#define LC1G2D4T                      2949
#define CLC1GLS1_D4T                  2950
#define CLC1GLS2                      2951
#define CLC1GLS2_D1N                  2952
#define LC1G3D1N                      2953
#define LC1G3D1T                      2954
#define CLC1GLS2_D1T                  2955
#define LC1G3D2N                      2956
#define CLC1GLS2_D2N                  2957
#define LC1G3D2T                      2958
#define CLC1GLS2_D2T                  2959
#define CLC1GLS2_D3N                  2960
#define LC1G3D3N                      2961
#define LC1G3D3T                      2962
#define CLC1GLS2_D3T                  2963
#define LC1G3D4N                      2964
#define CLC1GLS2_D4N                  2965
#define LC1G3D4T                      2966
#define CLC1GLS2_D4T                  2967
#define CLC1GLS3                      2968
#define LC1G4D1N                      2969
#define CLC1GLS3_G4D1N                2970
#define LC1G4D1T                      2971
#define CLC1GLS3_G4D1T                2972
#define CLC1GLS3_G4D2N                2973
#define LC1G4D2N                      2974
#define CLC1GLS3_G4D2T                2975
#define LC1G4D2T                      2976
#define LC1G4D3N                      2977
#define CLC1GLS3_G4D3N                2978
#define LC1G4D3T                      2979
#define CLC1GLS3_G4D3T                2980
#define CLC1GLS3_G4D4N                2981
#define LC1G4D4N                      2982
#define CLC1GLS3_G4D4T                2983
#define LC1G4D4T                      2984
#define CLC2CON                       2985
#define LC2MODE0                      2986
#define CLC2CON_MODE                  2987
#define LC2MODE                       2988
#define CLC2CON_MODE0                 2989
#define LC2MODE1                      2990
#define CLC2CON_MODE1                 2991
#define LC2MODE2                      2992
#define CLC2CON_MODE2                 2993
#define LC2INTN                       2994
#define CLC2CON_INTN                  2995
#define LC2INTP                       2996
#define CLC2CON_INTP                  2997
#define CLC2CON_OUT                   2998
#define LC2OUT                        2999
#define CLC2CON_EN                    3000
#define LC2EN                         3001
#define CLC2POL                       3002
#define LC2G1POL                      3003
#define CLC2POL_G1POL                 3004
#define LC2G2POL                      3005
#define CLC2POL_G2POL                 3006
#define LC2G3POL                      3007
#define CLC2POL_G3POL                 3008
#define LC2G4POL                      3009
#define CLC2POL_G4POL                 3010
#define CLC2POL_POL                   3011
#define LC2POL                        3012
#define CLC2SEL0                      3013
#define CLC2SEL0_D1S                  3014
#define LC2D1S                        3015
#define LC2D1S0                       3016
#define CLC2SEL0_D1S0                 3017
#define LC2D1S1                       3018
#define CLC2SEL0_D1S1                 3019
#define LC2D1S2                       3020
#define CLC2SEL0_D1S2                 3021
#define LC2D1S3                       3022
#define CLC2SEL0_D1S3                 3023
#define LC2D1S4                       3024
#define CLC2SEL0_D1S4                 3025
#define LC2D1S5                       3026
#define CLC2SEL0_D1S5                 3027
#define LC2D1S6                       3028
#define CLC2SEL0_D1S6                 3029
#define LC2D1S7                       3030
#define CLC2SEL0_D1S7                 3031
#define CLC2SEL1                      3032
#define LC2D2S0                       3033
#define LC2D2S                        3034
#define CLC2SEL1_D2S                  3035
#define CLC2SEL1_D2S0                 3036
#define LC2D2S1                       3037
#define CLC2SEL1_D2S1                 3038
#define LC2D2S2                       3039
#define CLC2SEL1_D2S2                 3040
#define LC2D2S3                       3041
#define CLC2SEL1_D2S3                 3042
#define LC2D2S4                       3043
#define CLC2SEL1_D2S4                 3044
#define LC2D2S5                       3045
#define CLC2SEL1_D2S5                 3046
#define LC2D2S6                       3047
#define CLC2SEL1_D2S6                 3048
#define LC2D2S7                       3049
#define CLC2SEL1_D2S7                 3050
#define CLC2SEL2                      3051
#define CLC2SEL2_D3S0                 3052
#define LC2D3S                        3053
#define CLC2SEL2_D3S                  3054
#define LC2D3S0                       3055
#define CLC2SEL2_D3S1                 3056
#define LC2D3S1                       3057
#define CLC2SEL2_D3S2                 3058
#define LC2D3S2                       3059
#define CLC2SEL2_D3S3                 3060
#define LC2D3S3                       3061
#define CLC2SEL2_D3S4                 3062
#define LC2D3S4                       3063
#define CLC2SEL2_D3S5                 3064
#define LC2D3S5                       3065
#define CLC2SEL2_D3S6                 3066
#define LC2D3S6                       3067
#define CLC2SEL2_D3S7                 3068
#define LC2D3S7                       3069
#define CLC2SEL3                      3070
#define LC2D4S                        3071
#define CLC2SEL3_D4S0                 3072
#define LC2D4S0                       3073
#define CLC2SEL3_D4S                  3074
#define CLC2SEL3_D4S1                 3075
#define LC2D4S1                       3076
#define CLC2SEL3_D4S2                 3077
#define LC2D4S2                       3078
#define CLC2SEL3_D4S3                 3079
#define LC2D4S3                       3080
#define CLC2SEL3_D4S4                 3081
#define LC2D4S4                       3082
#define CLC2SEL3_D4S5                 3083
#define LC2D4S5                       3084
#define CLC2SEL3_D4S6                 3085
#define LC2D4S6                       3086
#define CLC2SEL3_D4S7                 3087
#define LC2D4S7                       3088
#define CLC2GLS0                      3089
#define LC2G1D1N                      3090
#define CLC2GLS0_D1N                  3091
#define CLC2GLS0_D1T                  3092
#define LC2G1D1T                      3093
#define LC2G1D2N                      3094
#define CLC2GLS0_D2N                  3095
#define CLC2GLS0_D2T                  3096
#define LC2G1D2T                      3097
#define LC2G1D3N                      3098
#define CLC2GLS0_D3N                  3099
#define CLC2GLS0_D3T                  3100
#define LC2G1D3T                      3101
#define LC2G1D4N                      3102
#define CLC2GLS0_D4N                  3103
#define CLC2GLS0_D4T                  3104
#define LC2G1D4T                      3105
#define CLC2GLS1                      3106
#define CLC2GLS1_D1N                  3107
#define LC2G2D1N                      3108
#define CLC2GLS1_D1T                  3109
#define LC2G2D1T                      3110
#define CLC2GLS1_D2N                  3111
#define LC2G2D2N                      3112
#define CLC2GLS1_D2T                  3113
#define LC2G2D2T                      3114
#define LC2G2D3N                      3115
#define CLC2GLS1_D3N                  3116
#define LC2G2D3T                      3117
#define CLC2GLS1_D3T                  3118
#define LC2G2D4N                      3119
#define CLC2GLS1_D4N                  3120
#define LC2G2D4T                      3121
#define CLC2GLS1_D4T                  3122
#define CLC2GLS2                      3123
#define LC2G3D1N                      3124
#define CLC2GLS2_D1N                  3125
#define CLC2GLS2_D1T                  3126
#define LC2G3D1T                      3127
#define CLC2GLS2_D2N                  3128
#define LC2G3D2N                      3129
#define LC2G3D2T                      3130
#define CLC2GLS2_D2T                  3131
#define CLC2GLS2_D3N                  3132
#define LC2G3D3N                      3133
#define CLC2GLS2_D3T                  3134
#define LC2G3D3T                      3135
#define CLC2GLS2_D4N                  3136
#define LC2G3D4N                      3137
#define LC2G3D4T                      3138
#define CLC2GLS2_D4T                  3139
#define CLC2GLS3                      3140
#define LC2G4D1N                      3141
#define CLC2GLS3_G4D1N                3142
#define CLC2GLS3_G4D1T                3143
#define LC2G4D1T                      3144
#define CLC2GLS3_G4D2N                3145
#define LC2G4D2N                      3146
#define LC2G4D2T                      3147
#define CLC2GLS3_G4D2T                3148
#define CLC2GLS3_G4D3N                3149
#define LC2G4D3N                      3150
#define CLC2GLS3_G4D3T                3151
#define LC2G4D3T                      3152
#define LC2G4D4N                      3153
#define CLC2GLS3_G4D4N                3154
#define CLC2GLS3_G4D4T                3155
#define LC2G4D4T                      3156
#define CLC3CON                       3157
#define LC3MODE                       3158
#define CLC3CON_MODE0                 3159
#define LC3MODE0                      3160
#define CLC3CON_MODE                  3161
#define CLC3CON_MODE1                 3162
#define LC3MODE1                      3163
#define CLC3CON_MODE2                 3164
#define LC3MODE2                      3165
#define LC3INTN                       3166
#define CLC3CON_INTN                  3167
#define LC3INTP                       3168
#define CLC3CON_INTP                  3169
#define LC3OUT                        3170
#define CLC3CON_OUT                   3171
#define LC3EN                         3172
#define CLC3CON_EN                    3173
#define CLC3POL                       3174
#define LC3G1POL                      3175
#define CLC3POL_G1POL                 3176
#define LC3G2POL                      3177
#define CLC3POL_G2POL                 3178
#define CLC3POL_G3POL                 3179
#define LC3G3POL                      3180
#define LC3G4POL                      3181
#define CLC3POL_G4POL                 3182
#define LC3POL                        3183
#define CLC3POL_POL                   3184
#define CLC3SEL0                      3185
#define LC3D1S                        3186
#define CLC3SEL0_D1S                  3187
#define LC3D1S0                       3188
#define CLC3SEL0_D1S0                 3189
#define LC3D1S1                       3190
#define CLC3SEL0_D1S1                 3191
#define LC3D1S2                       3192
#define CLC3SEL0_D1S2                 3193
#define LC3D1S3                       3194
#define CLC3SEL0_D1S3                 3195
#define LC3D1S4                       3196
#define CLC3SEL0_D1S4                 3197
#define LC3D1S5                       3198
#define CLC3SEL0_D1S5                 3199
#define LC3D1S6                       3200
#define CLC3SEL0_D1S6                 3201
#define LC3D1S7                       3202
#define CLC3SEL0_D1S7                 3203
#define CLC3SEL1                      3204
#define LC3D2S0                       3205
#define LC3D2S                        3206
#define CLC3SEL1_D2S0                 3207
#define CLC3SEL1_D2S                  3208
#define LC3D2S1                       3209
#define CLC3SEL1_D2S1                 3210
#define LC3D2S2                       3211
#define CLC3SEL1_D2S2                 3212
#define LC3D2S3                       3213
#define CLC3SEL1_D2S3                 3214
#define LC3D2S4                       3215
#define CLC3SEL1_D2S4                 3216
#define LC3D2S5                       3217
#define CLC3SEL1_D2S5                 3218
#define LC3D2S6                       3219
#define CLC3SEL1_D2S6                 3220
#define LC3D2S7                       3221
#define CLC3SEL1_D2S7                 3222
#define CLC3SEL2                      3223
#define LC3D3S                        3224
#define CLC3SEL2_D3S                  3225
#define LC3D3S0                       3226
#define CLC3SEL2_D3S0                 3227
#define LC3D3S1                       3228
#define CLC3SEL2_D3S1                 3229
#define LC3D3S2                       3230
#define CLC3SEL2_D3S2                 3231
#define LC3D3S3                       3232
#define CLC3SEL2_D3S3                 3233
#define LC3D3S4                       3234
#define CLC3SEL2_D3S4                 3235
#define LC3D3S5                       3236
#define CLC3SEL2_D3S5                 3237
#define LC3D3S6                       3238
#define CLC3SEL2_D3S6                 3239
#define LC3D3S7                       3240
#define CLC3SEL2_D3S7                 3241
#define CLC3SEL3                      3242
#define CLC3SEL3_D4S                  3243
#define LC3D4S0                       3244
#define LC3D4S                        3245
#define CLC3SEL3_D4S0                 3246
#define LC3D4S1                       3247
#define CLC3SEL3_D4S1                 3248
#define LC3D4S2                       3249
#define CLC3SEL3_D4S2                 3250
#define LC3D4S3                       3251
#define CLC3SEL3_D4S3                 3252
#define LC3D4S4                       3253
#define CLC3SEL3_D4S4                 3254
#define LC3D4S5                       3255
#define CLC3SEL3_D4S5                 3256
#define LC3D4S6                       3257
#define CLC3SEL3_D4S6                 3258
#define LC3D4S7                       3259
#define CLC3SEL3_D4S7                 3260
#define CLC3GLS0                      3261
#define CLC3GLS0_D1N                  3262
#define LC3G1D1N                      3263
#define LC3G1D1T                      3264
#define CLC3GLS0_D1T                  3265
#define LC3G1D2N                      3266
#define CLC3GLS0_D2N                  3267
#define CLC3GLS0_D2T                  3268
#define LC3G1D2T                      3269
#define CLC3GLS0_D3N                  3270
#define LC3G1D3N                      3271
#define LC3G1D3T                      3272
#define CLC3GLS0_D3T                  3273
#define CLC3GLS0_D4N                  3274
#define LC3G1D4N                      3275
#define CLC3GLS0_D4T                  3276
#define LC3G1D4T                      3277
#define CLC3GLS1                      3278
#define LC3G2D1N                      3279
#define CLC3GLS1_D1N                  3280
#define CLC3GLS1_D1T                  3281
#define LC3G2D1T                      3282
#define LC3G2D2N                      3283
#define CLC3GLS1_D2N                  3284
#define LC3G2D2T                      3285
#define CLC3GLS1_D2T                  3286
#define LC3G2D3N                      3287
#define CLC3GLS1_D3N                  3288
#define CLC3GLS1_D3T                  3289
#define LC3G2D3T                      3290
#define LC3G2D4N                      3291
#define CLC3GLS1_D4N                  3292
#define LC3G2D4T                      3293
#define CLC3GLS1_D4T                  3294
#define CLC3GLS2                      3295
#define LC3G3D1N                      3296
#define CLC3GLS2_D1N                  3297
#define LC3G3D1T                      3298
#define CLC3GLS2_D1T                  3299
#define CLC3GLS2_D2N                  3300
#define LC3G3D2N                      3301
#define CLC3GLS2_D2T                  3302
#define LC3G3D2T                      3303
#define CLC3GLS2_D3N                  3304
#define LC3G3D3N                      3305
#define LC3G3D3T                      3306
#define CLC3GLS2_D3T                  3307
#define CLC3GLS2_D4N                  3308
#define LC3G3D4N                      3309
#define CLC3GLS2_D4T                  3310
#define LC3G3D4T                      3311
#define CLC3GLS3                      3312
#define LC3G4D1N                      3313
#define CLC3GLS3_G4D1N                3314
#define LC3G4D1T                      3315
#define CLC3GLS3_G4D1T                3316
#define LC3G4D2N                      3317
#define CLC3GLS3_G4D2N                3318
#define CLC3GLS3_G4D2T                3319
#define LC3G4D2T                      3320
#define LC3G4D3N                      3321
#define CLC3GLS3_G4D3N                3322
