tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18876_tdd.h
#define CLC3GLS3_G4D3T                3323
#define LC3G4D3T                      3324
#define LC3G4D4N                      3325
#define CLC3GLS3_G4D4N                3326
#define LC3G4D4T                      3327
#define CLC3GLS3_G4D4T                3328
#define CLC4CON                       3329
#define LC4MODE                       3330
#define CLC4CON_MODE                  3331
#define LC4MODE0                      3332
#define CLC4CON_MODE0                 3333
#define LC4MODE1                      3334
#define CLC4CON_MODE1                 3335
#define LC4MODE2                      3336
#define CLC4CON_MODE2                 3337
#define LC4INTN                       3338
#define CLC4CON_INTN                  3339
#define CLC4CON_INTP                  3340
#define LC4INTP                       3341
#define CLC4CON_OUT                   3342
#define LC4OUT                        3343
#define CLC4CON_EN                    3344
#define LC4EN                         3345
#define CLC4POL                       3346
#define CLC4POL_G1POL                 3347
#define LC4G1POL                      3348
#define CLC4POL_G2POL                 3349
#define LC4G2POL                      3350
#define CLC4POL_G3POL                 3351
#define LC4G3POL                      3352
#define LC4G4POL                      3353
#define CLC4POL_G4POL                 3354
#define LC4POL                        3355
#define CLC4POL_POL                   3356
#define CLC4SEL0                      3357
#define LC4D1S0                       3358
#define CLC4SEL0_D1S                  3359
#define CLC4SEL0_D1S0                 3360
#define LC4D1S                        3361
#define LC4D1S1                       3362
#define CLC4SEL0_D1S1                 3363
#define LC4D1S2                       3364
#define CLC4SEL0_D1S2                 3365
#define LC4D1S3                       3366
#define CLC4SEL0_D1S3                 3367
#define LC4D1S4                       3368
#define CLC4SEL0_D1S4                 3369
#define LC4D1S5                       3370
#define CLC4SEL0_D1S5                 3371
#define LC4D1S6                       3372
#define CLC4SEL0_D1S6                 3373
#define LC4D1S7                       3374
#define CLC4SEL0_D1S7                 3375
#define CLC4SEL1                      3376
#define CLC4SEL1_D2S                  3377
#define CLC4SEL1_D2S0                 3378
#define LC4D2S                        3379
#define LC4D2S0                       3380
#define CLC4SEL1_D2S1                 3381
#define LC4D2S1                       3382
#define CLC4SEL1_D2S2                 3383
#define LC4D2S2                       3384
#define CLC4SEL1_D2S3                 3385
#define LC4D2S3                       3386
#define CLC4SEL1_D2S4                 3387
#define LC4D2S4                       3388
#define CLC4SEL1_D2S5                 3389
#define LC4D2S5                       3390
#define CLC4SEL1_D2S6                 3391
#define LC4D2S6                       3392
#define CLC4SEL1_D2S7                 3393
#define LC4D2S7                       3394
#define CLC4SEL2                      3395
#define CLC4SEL2_D3S                  3396
#define LC4D3S0                       3397
#define LC4D3S                        3398
#define CLC4SEL2_D3S0                 3399
#define LC4D3S1                       3400
#define CLC4SEL2_D3S1                 3401
#define LC4D3S2                       3402
#define CLC4SEL2_D3S2                 3403
#define LC4D3S3                       3404
#define CLC4SEL2_D3S3                 3405
#define LC4D3S4                       3406
#define CLC4SEL2_D3S4                 3407
#define LC4D3S5                       3408
#define CLC4SEL2_D3S5                 3409
#define LC4D3S6                       3410
#define CLC4SEL2_D3S6                 3411
#define LC4D3S7                       3412
#define CLC4SEL2_D3S7                 3413
#define CLC4SEL3                      3414
#define CLC4SEL3_D4S                  3415
#define LC4D4S0                       3416
#define CLC4SEL3_D4S0                 3417
#define LC4D4S                        3418
#define LC4D4S1                       3419
#define CLC4SEL3_D4S1                 3420
#define LC4D4S2                       3421
#define CLC4SEL3_D4S2                 3422
#define LC4D4S3                       3423
#define CLC4SEL3_D4S3                 3424
#define LC4D4S4                       3425
#define CLC4SEL3_D4S4                 3426
#define LC4D4S5                       3427
#define CLC4SEL3_D4S5                 3428
#define LC4D4S6                       3429
#define CLC4SEL3_D4S6                 3430
#define LC4D4S7                       3431
#define CLC4SEL3_D4S7                 3432
#define CLC4GLS0                      3433
#define CLC4GLS0_D1N                  3434
#define LC4G1D1N                      3435
#define CLC4GLS0_D1T                  3436
#define LC4G1D1T                      3437
#define CLC4GLS0_D2N                  3438
#define LC4G1D2N                      3439
#define CLC4GLS0_D2T                  3440
#define LC4G1D2T                      3441
#define CLC4GLS0_D3N                  3442
#define LC4G1D3N                      3443
#define CLC4GLS0_D3T                  3444
#define LC4G1D3T                      3445
#define CLC4GLS0_D4N                  3446
#define LC4G1D4N                      3447
#define CLC4GLS0_D4T                  3448
#define LC4G1D4T                      3449
#define CLC4GLS1                      3450
#define CLC4GLS1_D1N                  3451
#define LC4G2D1N                      3452
#define CLC4GLS1_D1T                  3453
#define LC4G2D1T                      3454
#define LC4G2D2N                      3455
#define CLC4GLS1_D2N                  3456
#define LC4G2D2T                      3457
#define CLC4GLS1_D2T                  3458
#define CLC4GLS1_D3N                  3459
#define LC4G2D3N                      3460
#define LC4G2D3T                      3461
#define CLC4GLS1_D3T                  3462
#define CLC4GLS1_D4N                  3463
#define LC4G2D4N                      3464
#define CLC4GLS1_D4T                  3465
#define LC4G2D4T                      3466
#define CLC4GLS2                      3467
#define CLC4GLS2_D1N                  3468
#define LC4G3D1N                      3469
#define CLC4GLS2_D1T                  3470
#define LC4G3D1T                      3471
#define LC4G3D2N                      3472
#define CLC4GLS2_D2N                  3473
#define LC4G3D2T                      3474
#define CLC4GLS2_D2T                  3475
#define CLC4GLS2_D3N                  3476
#define LC4G3D3N                      3477
#define CLC4GLS2_D3T                  3478
#define LC4G3D3T                      3479
#define LC4G3D4N                      3480
#define CLC4GLS2_D4N                  3481
#define LC4G3D4T                      3482
#define CLC4GLS2_D4T                  3483
#define CLC4GLS3                      3484
#define CLC4GLS3_G4D1N                3485
#define LC4G4D1N                      3486
#define LC4G4D1T                      3487
#define CLC4GLS3_G4D1T                3488
#define LC4G4D2N                      3489
#define CLC4GLS3_G4D2N                3490
#define LC4G4D2T                      3491
#define CLC4GLS3_G4D2T                3492
#define CLC4GLS3_G4D3N                3493
#define LC4G4D3N                      3494
#define CLC4GLS3_G4D3T                3495
#define LC4G4D3T                      3496
#define LC4G4D4N                      3497
#define CLC4GLS3_G4D4N                3498
#define LC4G4D4T                      3499
#define CLC4GLS3_G4D4T                3500
#define PPSLOCK                       3501
#define PPSLOCKED                     3502
#define INTPPS0                       3503
#define INTPPS                        3504
#define INTPPS1                       3505
#define INTPPS2                       3506
#define INTPPS3                       3507
#define T0CKIPPS                      3508
#define T0CKIPPS0                     3509
#define T0CKIPPS1                     3510
#define T0CKIPPS2                     3511
#define T0CKIPPS3                     3512
#define T1CKIPPS0                     3513
#define T1CKIPPS                      3514
#define T1CKIPPS1                     3515
#define T1CKIPPS2                     3516
#define T1CKIPPS3                     3517
#define T1CKIPPS4                     3518
#define T1GPPS0                       3519
#define T1GPPS                        3520
#define T1GPPS1                       3521
#define T1GPPS2                       3522
#define T1GPPS3                       3523
#define T1GPPS4                       3524
#define T3CKIPPS0                     3525
#define T3CKIPPS                      3526
#define T3CKIPPS1                     3527
#define T3CKIPPS2                     3528
#define T3CKIPPS3                     3529
#define T3CKIPPS4                     3530
#define T3GPPS0                       3531
#define T3GPPS                        3532
#define T3GPPS1                       3533
#define T3GPPS2                       3534
#define T3GPPS3                       3535
#define T3GPPS4                       3536
#define T5CKIPPS0                     3537
#define T5CKIPPS                      3538
#define T5CKIPPS1                     3539
#define T5CKIPPS2                     3540
#define T5CKIPPS3                     3541
#define T5CKIPPS4                     3542
#define T5GPPS                        3543
#define T5GPPS0                       3544
#define T5GPPS1                       3545
#define T5GPPS2                       3546
#define T5GPPS3                       3547
#define T5GPPS4                       3548
#define T2AINPPS                      3549
#define T2AINPPS0                     3550
#define T2AINPPS1                     3551
#define T2AINPPS2                     3552
#define T2AINPPS3                     3553
#define T2AINPPS4                     3554
#define T4AINPPS                      3555
#define T4AINPPS0                     3556
#define T4AINPPS1                     3557
#define T4AINPPS2                     3558
#define T4AINPPS3                     3559
#define T4AINPPS4                     3560
#define T6AINPPS0                     3561
#define T6AINPPS                      3562
#define T6AINPPS1                     3563
#define T6AINPPS2                     3564
#define T6AINPPS3                     3565
#define T6AINPPS4                     3566
#define CCP1PPS0                      3567
#define CCP1PPS                       3568
#define CCP1PPS1                      3569
#define CCP1PPS2                      3570
#define CCP1PPS3                      3571
#define CCP1PPS4                      3572
#define CCP2PPS0                      3573
#define CCP2PPS                       3574
#define CCP2PPS1                      3575
#define CCP2PPS2                      3576
#define CCP2PPS3                      3577
#define CCP2PPS4                      3578
#define CCP3PPS0                      3579
#define CCP3PPS                       3580
#define CCP3PPS1                      3581
#define CCP3PPS2                      3582
#define CCP3PPS3                      3583
#define CCP3PPS4                      3584
#define CCP4PPS0                      3585
#define CCP4PPS                       3586
#define CCP4PPS1                      3587
#define CCP4PPS2                      3588
#define CCP4PPS3                      3589
#define CCP4PPS4                      3590
#define CCP5PPS                       3591
#define CCP5PPS0                      3592
#define CCP5PPS1                      3593
#define CCP5PPS2                      3594
#define CCP5PPS3                      3595
#define CCP5PPS4                      3596
#define CCP6PPS                       3597
#define SMT1WINPPS                    3598
#define SMU1WINPPS0                   3599
#define SMU1WINPPS1                   3600
#define SMU1WINPPS2                   3601
#define SMU1WINPPS3                   3602
#define SMU1WINPPS4                   3603
#define SMT1SIGPPS                    3604
#define SMU1SIGPPS0                   3605
#define SMU1SIGPPS1                   3606
#define SMU1SIGPPS2                   3607
#define SMU1SIGPPS3                   3608
#define SMU1SIGPPS4                   3609
#define SMT2WINPPS                    3610
#define SMU2WINPPS0                   3611
#define SMU2WINPPS1                   3612
#define SMU2WINPPS2                   3613
#define SMU2WINPPS3                   3614
#define SMU2WINPPS4                   3615
#define SMT2SIGPPS                    3616
#define SMU2SIGPPS0                   3617
#define SMU2SIGPPS1                   3618
#define SMU2SIGPPS2                   3619
#define SMU2SIGPPS3                   3620
#define SMU2SIGPPS4                   3621
#define CWG1PPS0                      3622
#define CWG1PPS                       3623
#define CWG1PPS1                      3624
#define CWG1PPS2                      3625
#define CWG1PPS3                      3626
#define CWG1PPS4                      3627
#define CWG2PPS0                      3628
#define CWG2PPS                       3629
#define CWG2PPS1                      3630
#define CWG2PPS2                      3631
#define CWG2PPS3                      3632
#define CWG2PPS4                      3633
#define CWG3PPS0                      3634
#define CWG3PPS                       3635
#define CWG3PPS1                      3636
#define CWG3PPS2                      3637
#define CWG3PPS3                      3638
#define CWG3PPS4                      3639
#define MDCARLPPS                     3640
#define MDCARLPPS0                    3641
#define MDCARLPPS1                    3642
#define MDCARLPPS2                    3643
#define MDCARLPPS3                    3644
#define MDCARLPPS4                    3645
#define MDCARHPPS0                    3646
#define MDCARHPPS                     3647
#define MDCARHPPS1                    3648
#define MDCARHPPS2                    3649
#define MDCARHPPS3                    3650
#define MDCARHPPS4                    3651
#define MDSRCPPS0                     3652
#define MDSRCPPS                      3653
#define MDSRCPPS1                     3654
#define MDSRCPPS2                     3655
#define MDSRCPPS3                     3656
#define MDSRCPPS4                     3657
#define CLCIN0PPS                     3658
#define CLCIN0PPS0                    3659
#define CLCIN0PPS1                    3660
#define CLCIN0PPS2                    3661
#define CLCIN0PPS3                    3662
#define CLCIN0PPS4                    3663
#define CLCIN1PPS                     3664
#define CLCIN1PPS0                    3665
#define CLCIN1PPS1                    3666
#define CLCIN1PPS2                    3667
#define CLCIN1PPS3                    3668
#define CLCIN1PPS4                    3669
#define CLCIN2PPS                     3670
#define CLCIN2PPS0                    3671
#define CLCIN2PPS1                    3672
#define CLCIN2PPS2                    3673
#define CLCIN2PPS3                    3674
#define CLCIN2PPS4                    3675
#define CLCIN3PPS                     3676
#define CLCIN3PPS0                    3677
#define CLCIN3PPS1                    3678
#define CLCIN3PPS2                    3679
#define CLCIN3PPS3                    3680
#define CLCIN3PPS4                    3681
#define ADCACTPPS                     3682
#define ADCACTPPS0                    3683
#define ADCACTPPS1                    3684
#define ADCACTPPS2                    3685
#define ADCACTPPS3                    3686
#define ADCACTPPS4                    3687
#define SSP1CLKPPS                    3688
#define SSP1CLKPPS0                   3689
#define SSP1CLKPPS1                   3690
#define SSP1CLKPPS2                   3691
#define SSP1CLKPPS3                   3692
#define SSP1CLKPPS4                   3693
#define SSP1DATPPS                    3694
#define SSP1DATPPS0                   3695
#define SSP1DATPPS1                   3696
#define SSP1DATPPS2                   3697
#define SSP1DATPPS3                   3698
#define SSP1DATPPS4                   3699
#define SSP1SSPPS                     3700
#define SSP1SSPPS0                    3701
#define SSP1SSPPS1                    3702
#define SSP1SSPPS2                    3703
#define SSP1SSPPS3                    3704
#define SSP1SSPPS4                    3705
#define SSP2CLKPPS                    3706
#define SSP2CLKPPS0                   3707
#define SSP2CLKPPS1                   3708
#define SSP2CLKPPS2                   3709
#define SSP2CLKPPS3                   3710
#define SSP2CLKPPS4                   3711
#define SSP2DATPPS                    3712
#define SSP2DATPPS0                   3713
#define SSP2DATPPS1                   3714
#define SSP2DATPPS2                   3715
#define SSP2DATPPS3                   3716
#define SSP2DATPPS4                   3717
#define SSP2SSPPS                     3718
#define SSP2SSPPS0                    3719
#define SSP2SSPPS1                    3720
#define SSP2SSPPS2                    3721
#define SSP2SSPPS3                    3722
#define SSP2SSPPS4                    3723
#define RXPPS                         3724
#define RXPPS0                        3725
#define RXPPS1                        3726
#define RXPPS2                        3727
#define RXPPS3                        3728
#define RXPPS4                        3729
#define TXPPS                         3730
#define TXPPS0                        3731
#define TXPPS1                        3732
#define TXPPS2                        3733
#define TXPPS3                        3734
#define TXPPS4                        3735
#define RA0PPS                        3736
#define RA0PPS0                       3737
#define RA0PPS1                       3738
#define RA0PPS2                       3739
#define RA0PPS3                       3740
#define RA0PPS4                       3741
#define RA0PPS5                       3742
#define RA1PPS                        3743
#define RA1PPS0                       3744
#define RA1PPS1                       3745
#define RA1PPS2                       3746
#define RA1PPS3                       3747
#define RA1PPS4                       3748
#define RA1PPS5                       3749
#define RA2PPS                        3750
#define RA2PPS0                       3751
#define RA2PPS1                       3752
#define RA2PPS2                       3753
#define RA2PPS3                       3754
#define RA2PPS4                       3755
#define RA2PPS5                       3756
#define RA3PPS                        3757
#define RA3PPS0                       3758
#define RA3PPS1                       3759
#define RA3PPS2                       3760
#define RA3PPS3                       3761
#define RA3PPS4                       3762
#define RA3PPS5                       3763
#define RA4PPS                        3764
#define RA4PPS0                       3765
#define RA4PPS1                       3766
#define RA4PPS2                       3767
#define RA4PPS3                       3768
#define RA4PPS4                       3769
#define RA4PPS5                       3770
#define RA5PPS                        3771
#define RA5PPS0                       3772
#define RA5PPS1                       3773
#define RA5PPS2                       3774
#define RA5PPS3                       3775
#define RA5PPS4                       3776
#define RA5PPS5                       3777
#define RA6PPS                        3778
#define RA6PPS0                       3779
#define RA6PPS1                       3780
#define RA6PPS2                       3781
#define RA6PPS3                       3782
#define RA6PPS4                       3783
#define RA6PPS5                       3784
#define RA7PPS                        3785
#define RA7PPS0                       3786
#define RA7PPS1                       3787
#define RA7PPS2                       3788
#define RA7PPS3                       3789
#define RA7PPS4                       3790
#define RA7PPS5                       3791
#define RB0PPS                        3792
#define RB0PPS0                       3793
#define RB0PPS1                       3794
#define RB0PPS2                       3795
#define RB0PPS3                       3796
#define RB0PPS4                       3797
#define RB0PPS5                       3798
#define RB1PPS                        3799
#define RB1PPS0                       3800
#define RB1PPS1                       3801
#define RB1PPS2                       3802
#define RB1PPS3                       3803
#define RB1PPS4                       3804
#define RB1PPS5                       3805
#define RB2PPS                        3806
#define RB2PPS0                       3807
#define RB2PPS1                       3808
#define RB2PPS2                       3809
#define RB2PPS3                       3810
#define RB2PPS4                       3811
#define RB2PPS5                       3812
#define RB3PPS                        3813
#define RB3PPS0                       3814
#define RB3PPS1                       3815
#define RB3PPS2                       3816
#define RB3PPS3                       3817
#define RB3PPS4                       3818
#define RB3PPS5                       3819
#define RB4PPS                        3820
#define RB4PPS0                       3821
#define RB4PPS1                       3822
#define RB4PPS2                       3823
#define RB4PPS3                       3824
#define RB4PPS4                       3825
#define RB4PPS5                       3826
#define RB5PPS                        3827
#define RB5PPS0                       3828
#define RB5PPS1                       3829
#define RB5PPS2                       3830
#define RB5PPS3                       3831
#define RB5PPS4                       3832
#define RB5PPS5                       3833
#define RB6PPS                        3834
#define RB6PPS0                       3835
#define RB6PPS1                       3836
#define RB6PPS2                       3837
#define RB6PPS3                       3838
#define RB6PPS4                       3839
#define RB6PPS5                       3840
#define RB7PPS                        3841
#define RB7PPS0                       3842
#define RB7PPS1                       3843
#define RB7PPS2                       3844
#define RB7PPS3                       3845
#define RB7PPS4                       3846
#define RB7PPS5                       3847
#define RC0PPS                        3848
#define RC0PPS0                       3849
#define RC0PPS1                       3850
#define RC0PPS2                       3851
#define RC0PPS3                       3852
#define RC0PPS4                       3853
#define RC0PPS5                       3854
#define RC1PPS                        3855
#define RC1PPS0                       3856
#define RC1PPS1                       3857
#define RC1PPS2                       3858
#define RC1PPS3                       3859
#define RC1PPS4                       3860
#define RC1PPS5                       3861
#define RC2PPS                        3862
#define RC2PPS0                       3863
#define RC2PPS1                       3864
#define RC2PPS2                       3865
#define RC2PPS3                       3866
#define RC2PPS4                       3867
#define RC2PPS5                       3868
#define RC3PPS                        3869
#define RC3PPS0                       3870
#define RC3PPS1                       3871
#define RC3PPS2                       3872
#define RC3PPS3                       3873
#define RC3PPS4                       3874
#define RC3PPS5                       3875
#define RC4PPS                        3876
#define RC4PPS0                       3877
#define RC4PPS1                       3878
#define RC4PPS2                       3879
#define RC4PPS3                       3880
