tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18876_tdd.h
#define RC4PPS4                       3881
#define RC4PPS5                       3882
#define RC5PPS                        3883
#define RC5PPS0                       3884
#define RC5PPS1                       3885
#define RC5PPS2                       3886
#define RC5PPS3                       3887
#define RC5PPS4                       3888
#define RC5PPS5                       3889
#define RC6PPS                        3890
#define RC6PPS0                       3891
#define RC6PPS1                       3892
#define RC6PPS2                       3893
#define RC6PPS3                       3894
#define RC6PPS4                       3895
#define RC6PPS5                       3896
#define RC7PPS                        3897
#define RC7PPS0                       3898
#define RC7PPS1                       3899
#define RC7PPS2                       3900
#define RC7PPS3                       3901
#define RC7PPS4                       3902
#define RC7PPS5                       3903
#define RD0PPS                        3904
#define RD0PPS0                       3905
#define RD0PPS1                       3906
#define RD0PPS2                       3907
#define RD0PPS3                       3908
#define RD0PPS4                       3909
#define RD0PPS5                       3910
#define RD1PPS                        3911
#define RD1PPS0                       3912
#define RD1PPS1                       3913
#define RD1PPS2                       3914
#define RD1PPS3                       3915
#define RD1PPS4                       3916
#define RD1PPS5                       3917
#define RD2PPS                        3918
#define RD2PPS0                       3919
#define RD2PPS1                       3920
#define RD2PPS2                       3921
#define RD2PPS3                       3922
#define RD2PPS4                       3923
#define RD2PPS5                       3924
#define RD3PPS                        3925
#define RD3PPS0                       3926
#define RD3PPS1                       3927
#define RD3PPS2                       3928
#define RD3PPS3                       3929
#define RD3PPS4                       3930
#define RD3PPS5                       3931
#define RD4PPS                        3932
#define RD4PPS0                       3933
#define RD4PPS1                       3934
#define RD4PPS2                       3935
#define RD4PPS3                       3936
#define RD4PPS4                       3937
#define RD4PPS5                       3938
#define RD5PPS                        3939
#define RD5PPS0                       3940
#define RD5PPS1                       3941
#define RD5PPS2                       3942
#define RD5PPS3                       3943
#define RD5PPS4                       3944
#define RD5PPS5                       3945
#define RD6PPS                        3946
#define RD6PPS0                       3947
#define RD6PPS1                       3948
#define RD6PPS2                       3949
#define RD6PPS3                       3950
#define RD6PPS4                       3951
#define RD6PPS5                       3952
#define RD7PPS                        3953
#define RD7PPS0                       3954
#define RD7PPS1                       3955
#define RD7PPS2                       3956
#define RD7PPS3                       3957
#define RD7PPS4                       3958
#define RD7PPS5                       3959
#define RE0PPS                        3960
#define RE0PPS0                       3961
#define RE0PPS1                       3962
#define RE0PPS2                       3963
#define RE0PPS3                       3964
#define RE0PPS4                       3965
#define RE0PPS5                       3966
#define RE1PPS                        3967
#define RE1PPS0                       3968
#define RE1PPS1                       3969
#define RE1PPS2                       3970
#define RE1PPS3                       3971
#define RE1PPS4                       3972
#define RE1PPS5                       3973
#define RE2PPS                        3974
#define RE2PPS0                       3975
#define RE2PPS1                       3976
#define RE2PPS2                       3977
#define RE2PPS3                       3978
#define RE2PPS4                       3979
#define RE2PPS5                       3980
#define ANSELA                        3981
#define ANSA0                         3982
#define ANSA1                         3983
#define ANSA2                         3984
#define ANSA3                         3985
#define ANSA4                         3986
#define ANSA5                         3987
#define ANSA6                         3988
#define ANSA7                         3989
#define WPUA                          3990
#define WPUA0                         3991
#define WPUA1                         3992
#define WPUA2                         3993
#define WPUA3                         3994
#define WPUA4                         3995
#define WPUA5                         3996
#define WPUA6                         3997
#define WPUA7                         3998
#define ODCONA                        3999
#define ODCA0                         4000
#define ODCA1                         4001
#define ODCA2                         4002
#define ODCA3                         4003
#define ODCA4                         4004
#define ODCA5                         4005
#define ODCA6                         4006
#define ODCA7                         4007
#define SLRCONA                       4008
#define SLRA0                         4009
#define SLRA1                         4010
#define SLRA2                         4011
#define SLRA3                         4012
#define SLRA4                         4013
#define SLRA5                         4014
#define SLRA6                         4015
#define SLRA7                         4016
#define INLVLA                        4017
#define INLVLA0                       4018
#define INLVLA1                       4019
#define INLVLA2                       4020
#define INLVLA3                       4021
#define INLVLA4                       4022
#define INLVLA5                       4023
#define INLVLA6                       4024
#define INLVLA7                       4025
#define IOCAP                         4026
#define IOCAP0                        4027
#define IOCAP1                        4028
#define IOCAP2                        4029
#define IOCAP3                        4030
#define IOCAP4                        4031
#define IOCAP5                        4032
#define IOCAP6                        4033
#define IOCAP7                        4034
#define IOCAN                         4035
#define IOCAN0                        4036
#define IOCAN1                        4037
#define IOCAN2                        4038
#define IOCAN3                        4039
#define IOCAN4                        4040
#define IOCAN5                        4041
#define IOCAN6                        4042
#define IOCAN7                        4043
#define IOCAF                         4044
#define IOCAF0                        4045
#define IOCAF1                        4046
#define IOCAF2                        4047
#define IOCAF3                        4048
#define IOCAF4                        4049
#define IOCAF5                        4050
#define IOCAF6                        4051
#define IOCAF7                        4052
#define CCDNA                         4053
#define CCDNA0                        4054
#define CCDNA1                        4055
#define CCDNA2                        4056
#define CCDNA3                        4057
#define CCDNA4                        4058
#define CCDNA5                        4059
#define CCDNA6                        4060
#define CCDNA7                        4061
#define CCDPA                         4062
#define CCDPA0                        4063
#define CCDPA1                        4064
#define CCDPA2                        4065
#define CCDPA3                        4066
#define CCDPA4                        4067
#define CCDPA5                        4068
#define CCDPA6                        4069
#define CCDPA7                        4070
#define ANSELB                        4071
#define ANSB0                         4072
#define ANSB1                         4073
#define ANSB2                         4074
#define ANSB3                         4075
#define ANSB4                         4076
#define ANSB5                         4077
#define ANSB6                         4078
#define ANSB7                         4079
#define WPUB                          4080
#define WPUB0                         4081
#define WPUB1                         4082
#define WPUB2                         4083
#define WPUB3                         4084
#define WPUB4                         4085
#define WPUB5                         4086
#define WPUB6                         4087
#define WPUB7                         4088
#define ODCONB                        4089
#define ODCB0                         4090
#define ODCB1                         4091
#define ODCB2                         4092
#define ODCB3                         4093
#define ODCB4                         4094
#define ODCB5                         4095
#define ODCB6                         4096
#define ODCB7                         4097
#define SLRCONB                       4098
#define SLRB0                         4099
#define SLRB1                         4100
#define SLRB2                         4101
#define SLRB3                         4102
#define SLRB4                         4103
#define SLRB5                         4104
#define SLRB6                         4105
#define SLRB7                         4106
#define INLVLB                        4107
#define INLVLB0                       4108
#define INLVLB1                       4109
#define INLVLB2                       4110
#define INLVLB3                       4111
#define INLVLB4                       4112
#define INLVLB5                       4113
#define INLVLB6                       4114
#define INLVLB7                       4115
#define IOCBP                         4116
#define IOCBP0                        4117
#define IOCBP1                        4118
#define IOCBP2                        4119
#define IOCBP3                        4120
#define IOCBP4                        4121
#define IOCBP5                        4122
#define IOCBP6                        4123
#define IOCBP7                        4124
#define IOCBN                         4125
#define IOCBN0                        4126
#define IOCBN1                        4127
#define IOCBN2                        4128
#define IOCBN3                        4129
#define IOCBN4                        4130
#define IOCBN5                        4131
#define IOCBN6                        4132
#define IOCBN7                        4133
#define IOCBF                         4134
#define IOCBF0                        4135
#define IOCBF1                        4136
#define IOCBF2                        4137
#define IOCBF3                        4138
#define IOCBF4                        4139
#define IOCBF5                        4140
#define IOCBF6                        4141
#define IOCBF7                        4142
#define CCDNB                         4143
#define CCDNB0                        4144
#define CCDNB1                        4145
#define CCDNB2                        4146
#define CCDNB3                        4147
#define CCDNB4                        4148
#define CCDNB5                        4149
#define CCDNB6                        4150
#define CCDNB7                        4151
#define CCDPB                         4152
#define CCDPB0                        4153
#define CCDPB1                        4154
#define CCDPB2                        4155
#define CCDPB3                        4156
#define CCDPB4                        4157
#define CCDPB5                        4158
#define CCDPB6                        4159
#define CCDPB7                        4160
#define ANSELC                        4161
#define ANSC0                         4162
#define ANSC1                         4163
#define ANSC2                         4164
#define ANSC3                         4165
#define ANSC4                         4166
#define ANSC5                         4167
#define ANSC6                         4168
#define ANSC7                         4169
#define WPUC                          4170
#define WPUC0                         4171
#define WPUC1                         4172
#define WPUC2                         4173
#define WPUC3                         4174
#define WPUC4                         4175
#define WPUC5                         4176
#define WPUC6                         4177
#define WPUC7                         4178
#define ODCONC                        4179
#define ODCC0                         4180
#define ODCC1                         4181
#define ODCC2                         4182
#define ODCC3                         4183
#define ODCC4                         4184
#define ODCC5                         4185
#define ODCC6                         4186
#define ODCC7                         4187
#define SLRCONC                       4188
#define SLRC0                         4189
#define SLRC1                         4190
#define SLRC2                         4191
#define SLRC3                         4192
#define SLRC4                         4193
#define SLRC5                         4194
#define SLRC6                         4195
#define SLRC7                         4196
#define INLVLC                        4197
#define INLVLC0                       4198
#define INLVLC1                       4199
#define INLVLC2                       4200
#define INLVLC3                       4201
#define INLVLC4                       4202
#define INLVLC5                       4203
#define INLVLC6                       4204
#define INLVLC7                       4205
#define IOCCP                         4206
#define IOCCP0                        4207
#define IOCCP1                        4208
#define IOCCP2                        4209
#define IOCCP3                        4210
#define IOCCP4                        4211
#define IOCCP5                        4212
#define IOCCP6                        4213
#define IOCCP7                        4214
#define IOCCN                         4215
#define IOCCN0                        4216
#define IOCCN1                        4217
#define IOCCN2                        4218
#define IOCCN3                        4219
#define IOCCN4                        4220
#define IOCCN5                        4221
#define IOCCN6                        4222
#define IOCCN7                        4223
#define IOCCF                         4224
#define IOCCF0                        4225
#define IOCCF1                        4226
#define IOCCF2                        4227
#define IOCCF3                        4228
#define IOCCF4                        4229
#define IOCCF5                        4230
#define IOCCF6                        4231
#define IOCCF7                        4232
#define CCDNC                         4233
#define CCDNC0                        4234
#define CCDNC1                        4235
#define CCDNC2                        4236
#define CCDNC3                        4237
#define CCDNC4                        4238
#define CCDNC5                        4239
#define CCDNC6                        4240
#define CCDNC7                        4241
#define CCDPC                         4242
#define CCDPC0                        4243
#define CCDPC1                        4244
#define CCDPC2                        4245
#define CCDPC3                        4246
#define CCDPC4                        4247
#define CCDPC5                        4248
#define CCDPC6                        4249
#define CCDPC7                        4250
#define ANSELD                        4251
#define ANSD0                         4252
#define ANSD1                         4253
#define ANSD2                         4254
#define ANSD3                         4255
#define ANSD4                         4256
#define ANSD5                         4257
#define ANSD6                         4258
#define ANSD7                         4259
#define WPUD                          4260
#define WPUD0                         4261
#define WPUD1                         4262
#define WPUD2                         4263
#define WPUD3                         4264
#define WPUD4                         4265
#define WPUD5                         4266
#define WPUD6                         4267
#define WPUD7                         4268
#define ODCOND                        4269
#define ODCD0                         4270
#define ODCD1                         4271
#define ODCD2                         4272
#define ODCD3                         4273
#define ODCD4                         4274
#define ODCD5                         4275
#define ODCD6                         4276
#define ODCD7                         4277
#define SLRCOND                       4278
#define SLRD0                         4279
#define SLRD1                         4280
#define SLRD2                         4281
#define SLRD3                         4282
#define SLRD4                         4283
#define SLRD5                         4284
#define SLRD6                         4285
#define SLRD7                         4286
#define INLVLD                        4287
#define INLVLD0                       4288
#define INLVLD1                       4289
#define INLVLD2                       4290
#define INLVLD3                       4291
#define INLVLD4                       4292
#define INLVLD5                       4293
#define INLVLD6                       4294
#define INLVLD7                       4295
#define CCDND                         4296
#define CCDND0                        4297
#define CCDND1                        4298
#define CCDND2                        4299
#define CCDND3                        4300
#define CCDND4                        4301
#define CCDND5                        4302
#define CCDND6                        4303
#define CCDND7                        4304
#define CCDPD                         4305
#define CCDPD0                        4306
#define CCDPD1                        4307
#define CCDPD2                        4308
#define CCDPD3                        4309
#define CCDPD4                        4310
#define CCDPD5                        4311
#define CCDPD6                        4312
#define CCDPD7                        4313
#define ANSELE                        4314
#define ANSE0                         4315
#define ANSE1                         4316
#define ANSE2                         4317
#define WPUE                          4318
#define WPUE0                         4319
#define WPUE1                         4320
#define WPUE2                         4321
#define WPUE3                         4322
#define ODCONE                        4323
#define ODCE0                         4324
#define ODCE1                         4325
#define ODCE2                         4326
#define SLRCONE                       4327
#define SLRE0                         4328
#define SLRE1                         4329
#define SLRE2                         4330
#define INLVLE                        4331
#define INLVLE0                       4332
#define INLVLE1                       4333
#define INLVLE2                       4334
#define INLVLE3                       4335
#define IOCEP                         4336
#define IOCEP3                        4337
#define IOCEN                         4338
#define IOCEN3                        4339
#define IOCEF                         4340
#define IOCEF3                        4341
#define CCDNE                         4342
#define CCDNE0                        4343
#define CCDNE1                        4344
#define CCDNE2                        4345
#define CCDPE                         4346
#define CCDPE0                        4347
#define CCDPE1                        4348
#define CCDPE2                        4349
#define STATUS_SHAD                   4350
#define C_SHAD                        4351
#define DC_SHAD                       4352
#define Z_SHAD                        4353
#define WREG_SHAD                     4354
#define BSR_SHAD                      4355
#define PCLATH_SHAD                   4356
#define FSR0L_SHAD                    4357
#define FSR0H_SHAD                    4358
#define FSR1L_SHAD                    4359
#define FSR1H_SHAD                    4360
#define STKPTR                        4361
#define TOSL                          4362
#define TOSH                          4363

#endif // _PIC16LF18876_H_
